"use client";
import { useRouter } from "next/navigation";
import React from "react";

const Terms = () => {
  const router = useRouter();
  return (
    <div className="text-black flex flex-col gap-2 p-2">
      <h4 className="font-semibold">1. ჩვენს შესახებ</h4>
      <span>ი/მ: ირაკლი ჯაბუა</span>
      <span>საიდენტიფიკაციო ნომერი: 19001054926</span>
      <span>მისამართი: ქ. ზუგდიდი, ც. დადიანის 3, ბინა 60</span>
      <span>ელ ფოსტა: geomarketdevelopment@mgil.com</span>
      <span>ტელეფონის ნომერი: +995 598 16 89 89</span>
      <p className="mt-4">
        ჩვენი პლატფორმა მომხმარებლებსა და გამყიდველებს აძლევს შესაძლებლობას
        შესთავაზონ, გაყიდონ და შეიძინონ სხვადასხვა სახის პროდუქცია საქართველოს
        მასშტაბით. მომხმარებლის წესები და პირობები განსაზღვრავს პლატფორმაზე
        არსებული სერვისების გამოყენების წესებს, ხოლო პროდუქტის გაყიდვისა და
        განცხადების განთავსების წესები შეგიძლიათ იხილოთ აქ:{" "}
        <span
          style={{ textDecoration: "underline" }}
          onClick={() => router.push("/terms/productUpload")}
        >
          [განცხადების განთავსების (ვაჭრობის) წესები]
        </span>
        . ჩვენი პლატფორმა წარმოადგენს „ელექტრონული კომერციის შესახებ“
        საქართველოს კანონით გათვალისწინებულ შუალედურ მომსახურების მიმწოდებელს.
        ჩვენ არ ვაწვდით პროდუქციას თავად; კომუნიკაცია ხდება გამყიდველსა და
        მყიდველს შორის, და ისინი თავად აგვარებენ მიწოდების პირობებს. გარკვეულ
        შემთხვევაში, პლატფორმა შეიძლება თავად იყოს გამყიდველი „მომხმარებლის
        უფლებების დაცვის შესახებ“ საქართველოს კანონის შესაბამისად. ეს მითითებული
        იქნება კონკრეტული პროდუქტის ან განცხადების აღწერილობაში
      </p>
      <p>2. მომხმარებლის, კომპანიისა და მოვაჭრის ურთიერთობა</p>
      <p>
        ეს წესები განსაზღვრავს ჩვენი საკომუნიკაციო პლატფორმის გამოყენების
        პირობებს. რეგისტრაციით თქვენ ეთანხმებით მათ საკუთარი და სხვა
        მომხმარებლების სახელით, ვინც თქვენი ანგარიშით სარგებლობს.
      </p>
      <p>
        1. ჩვენი კომპანია არის მხოლოდ შუამავალი პლატფორმა, რომელიც აკავშირებს
        მყიდველებს და გამყიდველებს. ჩვენ არ ვყიდით პროდუქციას პირდაპირ და არ
        ვერევით გარიგებებში.
      </p>
      <p>
        2. მომხმარებლისა და გამყიდველის ურთიერთობა რეგულირდება მხოლოდ მათ შორის,
        ჩვენი კომპანიის ჩარევის გარეშე.
      </p>
      <p>
        3. გამყიდველი (მეწარმე) სრულად და ერთპიროვნულად პასუხისმგებელია
        პროდუქტის ხარისხზე, ინფორმაციის სიზუსტეზე, დაბრუნებაზე, გარანტიაზე და
        ნებისმიერ სხვა საკითხზე, რაც უკავშირდება პროდუქტს ან მომსახურებას.
        <span className="text-red-600">
          ჩვენი კომპანია არ არის პასუხისმგებელი ამ საკითხებზე, რადგან ჩვენ არ
          ვყიდით პროდუქციას.
        </span>
      </p>
      <p>
        4. პრეტენზიების შემთხვევაში მომხმარებელმა უნდა მიმართოს პირდაპირ
        გამყიდველს. პროდუქტის აღწერაში მითითებული იქნება გამყიდველის დეტალური
        საკონტაქტო ინფორმაცია ამ მიზნით.
      </p>
      <p>
        <span className="text-red-600">
          5. ჩვენი კომპანია პასუხისმგებელია მხოლოდ პლატფორმის გამართულ მუშაობაზე
          და არა გარიგებების შინაარსზე, შედეგებზე ან პროდუქტის ხარისხზე.
        </span>
      </p>
      <p>
        6. კომპანია უფლებას იტოვებს, გააუქმოს ან შეაჩეროს ნებისმიერი განცხადება,
        თუ ის არღვევს პლატფორმის წესებს.
      </p>
      <p>
        7. ტექნიკური ხარვეზის გამო შეიძლება დროებით შეფერხდეს პლატფორმის
        მუშაობა. კომპანია არ არის პასუხისმგებელი ამით გამოწვეულ შესაძლო ზიანზე.
      </p>
      <p>
        8. ჩვენ შეიძლება განვათავსოთ მესამე მხარის ბმულები, მაგრამ არ
        ვაკონტროლებთ მათ შინაარსს. მომხმარებელი პასუხისმგებელია ამ რესურსების
        წესების გაცნობაზე.
      </p>
      <p>
        9. პლატფორმის შინაარსის ხელმისაწვდომობა შეიძლება დამოკიდებული იყოს
        საძიებო სისტემის შეზღუდვებზე. კომპანია არ არის პასუხისმგებელი გარკვეული
        სერვისების მიუწვდომლობაზე.
      </p>
      <p>
        10. ყველა გარიგება, ფინანსური ოპერაცია და პროდუქტის მიწოდება ხორციელდება
        უშუალოდ მყიდველსა და გამყიდველს შორის, ჩვენი ჩარევის გარეშე.
      </p>
      <h4>უსაფრთხოება:</h4>
      <div className="flex flex-col gap-2">
        <p>
          1. არასოდეს გაუზიაროთ თქვენი საბანკო ანგარიშის დეტალები, პაროლები ან
          პირადი ინფორმაცია უცნობ პირებს.
        </p>
        <p>
          2. ჩვენი კომპანია არასდროს მოგთხოვთ კონფიდენციალური ინფორმაციის
          მოწოდებას ელ-ფოსტით ან ტელეფონით
        </p>
        <p>
          3. ყურადღებით შეამოწმეთ გამყიდველის (სელერის) რეპუტაცია ტრანზაქციის
          განხორციელებამდე.
        </p>
        <p>
          4. კომპანია არ არის პასუხისმგებელი გამყიდველსა და მყიდველს შორის
          წარმოქმნილ დავებზე. პასუხისმგებლობა სრულად ეკისრება გამყიდველს.
        </p>
        <p>5. თუ საეჭვო აქტივობას შეამჩნევთ, დაუყოვნებლივ შეგვატყობინეთ.</p>
      </div>
      <h4>კონფიდენციალურობა:</h4>

      <div className="flex flex-col gap-2">
        <p>
          1. მონაცემების შეგროვება: კომპანია აგროვებს მომხმარებლის პერსონალურ
          ინფორმაციას ვებგვერდის გამოყენებისას, რეგისტრაციისას და მომსახურების
          მიღებისას.
        </p>
        <p>
          2. მონაცემების გამოყენება: ინფორმაცია გამოიყენება მომსახურების
          გასაწევად, პროდუქტების გასაუმჯობესებლად და მარკეტინგული მიზნებისთვის.
        </p>
        <p>
          3. მონაცემების გაზიარება: შესაძლებელია მონაცემების გაზიარება
          პარტნიორებთან, მომსახურების პროვაიდერებთან და კანონით გათვალისწინებულ
          შემთხვევებში.
        </p>
        <p>
          4. უსაფრთხოება: კომპანია იყენებს უსაფრთხოების ზომებს მონაცემების
          დასაცავად.
        </p>
        <p>
          5. მომხმარებლის უფლებები: მომხმარებელს აქვს უფლება მოითხოვოს
          ინფორმაცია, გასწორება ან წაშლა.
        </p>
        <p>
          6. პოლიტიკის ცვლილება: კომპანია იტოვებს უფლებას შეცვალოს პოლიტიკა და
          აცნობოს მომხმარებლებს.
        </p>
        <p>
          7. თანხმობა: ვებგვერდის გამოყენება ნიშნავს თანხმობას მონაცემების
          დამუშავებაზე.
        </p>
      </div>
    </div>
  );
};

export default Terms;
